## Plan Result (sbox_ai - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 9 to change, 3 to destroy.</code></pre>

* Create
  * module.ai.azurerm_cognitive_account.cognitive_account
  * module.ai.azurerm_role_assignment.blob_contributor_from_cognitive_account
* Update
  * azurerm_key_vault_secret.cognitive_account_primary_access_key
  * azurerm_key_vault_secret.cognitive_account_secondary_access_key
  * azurerm_resource_group.rg
  * module.ai.azurerm_ai_foundry.ai_foundry
  * module.ai.azurerm_machine_learning_workspace.ml_workspace
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.key_vault.azurerm_key_vault.kv
  * module.storage.azurerm_storage_account.storage_account
* Replace
  * module.ai.azurerm_private_endpoint.foundry_private_endpoint
  * module.ai.azurerm_private_endpoint.ml_private_endpoint
  * module.storage.azurerm_private_endpoint.this[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.cognitive_account_primary_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "cognitive_account_primary_access_key" {
        id                      = "https://dlrm-ingest-ai-kv-sbox.vault.azure.net/secrets/cognitive-account-primary-access-key/3c742191b55044af9f7f82079c0212bc"
        name                    = "cognitive-account-primary-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.cognitive_account_secondary_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "cognitive_account_secondary_access_key" {
        id                      = "https://dlrm-ingest-ai-kv-sbox.vault.azure.net/secrets/cognitive-account-secondary-access-key/a9ea42fe4c7f4daabd3546eae51ae1bc"
        name                    = "cognitive-account-secondary-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox"
        name       = "dlrm-ingest-ai-sbox"
      ~ tags       = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-14"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ai.azurerm_ai_foundry.ai_foundry will be updated in-place
  ~ resource "azurerm_ai_foundry" "ai_foundry" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ai-foundry-sbox"
        name                           = "dlrm-ingest-ai-foundry-sbox"
      ~ tags                           = {
          - "__SYSTEM__CognitiveService_dlrmingestcognitiveaccountsbox" = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.CognitiveServices/accounts/dlrm-ingest-cognitive-account-sbox"
          - "application"                                               = "dlrm-data-ingest"
          - "builtFrom"                                                 = "hmcts/dlrm-data-ingest-infra"
          - "businessArea"                                              = "cross-cutting"
          - "criticality"                                               = "Low"
          - "environment"                                               = "sandbox"
          - "expiresAfter"                                              = "2025-04-14"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_cognitive_account.cognitive_account will be created
  + resource "azurerm_cognitive_account" "cognitive_account" {
      + custom_subdomain_name              = "dlrm-ingest-cognitive-account-sbox"
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "FormRecognizer"
      + local_auth_enabled                 = true
      + location                           = "uksouth"
      + name                               = "dlrm-ingest-cognitive-account-sbox"
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = false
      + resource_group_name                = "dlrm-ingest-ai-sbox"
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "F0"
      + tags                               = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_acls {
          + default_action = "Deny"

          + virtual_network_rules {
              + ignore_missing_vnet_service_endpoint = false
              + subnet_id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
            }
        }
    }

  # module.ai.azurerm_machine_learning_workspace.ml_workspace will be updated in-place
  ~ resource "azurerm_machine_learning_workspace" "ml_workspace" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-sbox"
        name                           = "dlrm-ingest-ml-workspace-sbox"
      ~ tags                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-14"
        } -> (known after apply)
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_private_endpoint.foundry_private_endpoint must be replaced
-/+ resource "azurerm_private_endpoint" "foundry_private_endpoint" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ai-foundry-pe-sbox" -> (known after apply)
        name                          = "dlrm-ingest-ai-foundry-pe-sbox"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/networkInterfaces/dlrm-ingest-ai-foundry-pe-sbox.nic.0903f4ea-3da7-484f-8ebe-b2dbd73c98ec"
              - name = "dlrm-ingest-ai-foundry-pe-sbox.nic.0903f4ea-3da7-484f-8ebe-b2dbd73c98ec"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ai-foundry-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.api.azureml.ms"
              - name                = "privatelink.api.azureml.ms"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms"
              - record_sets         = [
                  - {
                      - fqdn         = "caec12fe-e86d-4022-a890-a3275a641be5.workspace.uksouth.privatelink.api.azureml.ms"
                      - ip_addresses = [
                          - "10.247.8.8",
                        ]
                      - name         = "caec12fe-e86d-4022-a890-a3275a641be5.workspace.uksouth"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "caec12fe-e86d-4022-a890-a3275a641be5.workspace.uksouth.cert.privatelink.api.azureml.ms"
                      - ip_addresses = [
                          - "10.247.8.8",
                        ]
                      - name         = "caec12fe-e86d-4022-a890-a3275a641be5.workspace.uksouth.cert"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "*.caec12fe-e86d-4022-a890-a3275a641be5.inference.uksouth.privatelink.api.azureml.ms"
                      - ip_addresses = [
                          - "10.247.8.10",
                        ]
                      - name         = "*.caec12fe-e86d-4022-a890-a3275a641be5.inference.uksouth"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
          - {
              - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ai-foundry-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.notebooks.azure.net"
              - name                = "privatelink.notebooks.azure.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ml-dlrm-ingest-ai--uksouth-caec12fe-e86d-4022-a890-a3275a641be5.uksouth.privatelink.notebooks.azure.net"
                      - ip_addresses = [
                          - "10.247.8.9",
                        ]
                      - name         = "ml-dlrm-ingest-ai--uksouth-caec12fe-e86d-4022-a890-a3275a641be5.uksouth"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ subnet_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-aria-migration-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox" # forces replacement
      - tags                          = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "sandbox"
        } -> null
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ai-foundry-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "ai-foundry-psc"
          ~ private_ip_address                = "10.247.8.8" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.ai.azurerm_private_endpoint.ml_private_endpoint must be replaced
-/+ resource "azurerm_private_endpoint" "ml_private_endpoint" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ml-workspace-pe-sbox" -> (known after apply)
        name                          = "dlrm-ingest-ml-workspace-pe-sbox"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/networkInterfaces/dlrm-ingest-ml-workspace-pe-sbox.nic.aa91b038-8e23-480c-951c-4b46cb31875b"
              - name = "dlrm-ingest-ml-workspace-pe-sbox.nic.aa91b038-8e23-480c-951c-4b46cb31875b"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ml-workspace-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.api.azureml.ms"
              - name                = "privatelink.api.azureml.ms"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms"
              - record_sets         = [
                  - {
                      - fqdn         = "8f961efa-e0ea-475f-9949-151b13c87ccd.workspace.uksouth.privatelink.api.azureml.ms"
                      - ip_addresses = [
                          - "10.247.8.5",
                        ]
                      - name         = "8f961efa-e0ea-475f-9949-151b13c87ccd.workspace.uksouth"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "8f961efa-e0ea-475f-9949-151b13c87ccd.workspace.uksouth.cert.privatelink.api.azureml.ms"
                      - ip_addresses = [
                          - "10.247.8.5",
                        ]
                      - name         = "8f961efa-e0ea-475f-9949-151b13c87ccd.workspace.uksouth.cert"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "*.8f961efa-e0ea-475f-9949-151b13c87ccd.inference.uksouth.privatelink.api.azureml.ms"
                      - ip_addresses = [
                          - "10.247.8.7",
                        ]
                      - name         = "*.8f961efa-e0ea-475f-9949-151b13c87ccd.inference.uksouth"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
          - {
              - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ml-workspace-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.notebooks.azure.net"
              - name                = "privatelink.notebooks.azure.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ml-dlrm-ingest-ml--uksouth-8f961efa-e0ea-475f-9949-151b13c87ccd.uksouth.privatelink.notebooks.azure.net"
                      - ip_addresses = [
                          - "10.247.8.6",
                        ]
                      - name         = "ml-dlrm-ingest-ml--uksouth-8f961efa-e0ea-475f-9949-151b13c87ccd.uksouth"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ subnet_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-aria-migration-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox" # forces replacement
      - tags                          = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "sandbox"
        } -> null
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ml-workspace-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "ml-workspace-psc"
          ~ private_ip_address                = "10.247.8.5" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.ai.azurerm_role_assignment.blob_contributor_from_cognitive_account will be created
  + resource "azurerm_role_assignment" "blob_contributor_from_cognitive_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Storage/storageAccounts/dlrmingestaisasbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Insights/components/dlrm-ingest-ai-appinsights-sbox"
        name                                  = "dlrm-ingest-ai-appinsights-sbox"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-14"
        } -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - dlrm-ingest-ai-appinsights-sbox"
        name                = "Application Insights daily cap reached - dlrm-ingest-ai-appinsights-sbox"
      ~ tags                = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-14"
        } -> (known after apply)
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.key_vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-ai-kv-sbox"
        name                            = "dlrm-ingest-ai-kv-sbox"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-14"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.storage.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrmingestaisasbox" -> (known after apply)
        name                          = "dlrmingestaisasbox"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/networkInterfaces/dlrmingestaisasbox.nic.7dc1f79e-138c-4a32-9d65-5c3240f6f236"
              - name = "dlrmingestaisasbox.nic.7dc1f79e-138c-4a32-9d65-5c3240f6f236"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrmingestaisasbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "dlrmingestaisasbox.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.247.8.4",
                        ]
                      - name         = "dlrmingestaisasbox"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ subnet_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-aria-migration-sbox" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox" # forces replacement
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-14"
        } -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrmingestaisasbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "dlrmingestaisasbox"
          ~ private_ip_address                = "10.247.8.4" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Storage/storageAccounts/dlrmingestaisasbox"
        name                               = "dlrmingestaisasbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-14"
        } -> (known after apply)
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 9 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":86,"Program":"tfcmt","SHA1":"","Target":"sbox_ai - TerraformPlanApply","Vars":{}} -->